[
  {
    "title": "Bastex Back Cover for Moto G9  (Multicolor)",
    "price": 219,
    "currency": "INR",
    "original_price": 999,
    "discount": "78% off",
    "description": "Bastex back covers are the best attractive accessory to make your mobile unique from other models .The Premium case is made out of a light, durable plastic called Polycarbonate.It is strong enough to protect it from bumps, drops and scratches.Wide array of designs and models.A raised bezel protects your display when mobile is laid flat, and the volume and power buttons are explicitly carved, so all buttons and ports are easily accessible. This case is 100% compatible with your regular charger and headphones. Kindly Note: **There may be slight change in color of design printed on case as seen on website, as there can be different monitors/tablets/smart phones settings**"
  },
  {
    "title": "Devilart Back Cover for Lava X11  (Multicolor, Waterproof, Silicon)",
    "price": 188,
    "currency": "INR",
    "original_price": 659,
    "discount": "71% off",
    "description": "Now you can stylishly & easily protect your smartphone with this modern case protection. This case covers the back and corners of your smartphone with an impact resistant, flexible Soft shell, while still providing access to all ports and buttons. Designed for your phone this sleek and lightweight case is the perfect way to show off your style. This case acts as the perfect weapon you require to guard your phone from everything unwanted. It covers the entire front of the case with the artwork. It has permanent embedded designs with high print quality which are long lasting , Hence your design won't peel off. This case fully covers the back side of your mobile and hence you do not have to replace the original back cover."
  },
  {
    "title": "SY Gifts Back Cover for Apple iPhone 7  (Multicolor)",
    "price": 199,
    "currency": "INR",
    "original_price": 599,
    "discount": "66% off",
    "description": "Samurai Mobile Back Cover For Iphone 7"
  },
  {
    "title": "Exclusivebay Back Cover for Micromax Canvas 5 E481  (Black, White)",
    "price": 219,
    "currency": "INR",
    "original_price": 999,
    "discount": "78% off",
    "description": "Exclusivebay back covers are the best attractive accessory to make your mobile unique from other models .The Premium case is made out of a light, durable plastic called Polycarbonate.It is strong enough to protect it from bumps, drops and scratches.Wide array of designs and models.A raised bezel protects your display when mobile is laid flat, and the volume and power buttons are explicitly carved, so all buttons and ports are easily accessible. This case is 100% compatible with your regular charger and headphones. Kindly Note: **There may be slight change in color of design printed on case as seen on website, as there can be different monitors/tablets/smart phones settings**."
  },
  {
    "title": "Coolboys Back Cover for Tecno KE-6 / KE6  (Purple, Waterproof, Silicon)",
    "price": 197,
    "currency": "INR",
    "original_price": 659,
    "discount": "70% off",
    "description": "Now you can stylishly & easily protect your smartphone with this modern case protection. This case covers the back and corners of your smartphone with an impact resistant, flexible Soft shell, while still providing access to all ports and buttons. Designed for your phone this sleek and lightweight case is the perfect way to show off your style. This case acts as the perfect weapon you require to guard your phone from everything unwanted. It covers the entire front of the case with the artwork. It has permanent embedded designs with high print quality which are long lasting , Hence your design won't peel off. This case fully covers the back side of your mobile and hence you do not have to replace the original back cover."
  },
  {
    "title": "quadronic Back Cover for Redmi Note 9 Pro Max, Smoke Translucent Shock Proof Smooth Rubberized Matte Hard Back Case Cover  (Green)",
    "price": 179,
    "currency": "INR",
    "original_price": 398,
    "discount": "55% off"
  },
  {
    "title": "MotohunK 1 Car Body Cover, 2 Light 1 Remote Combo",
    "price": 1499,
    "currency": "INR",
    "original_price": 1999,
    "discount": "25% off",
    "description": "Material Protects Your Vehicle Against Wet, Humid And Dusty Climatic Conditions. Hi-Performance Fabric Naturally Resists Moisture, Fungus And Expels Stale Odour. Ultrasonic Welding Seals Seams Tight And Securely (Other Covers Use Common Thread) Keeps Your Vehicle Cooler, Dry And Dust Free, It Remains Unaffected By Climatic Conditions Uses Reinforced Side Grommets For Cover Tie-Down Uv Stable Materials Ensure A Long Life.2x T10 5050 RGB Led Light Bulbs With 16 Super RGB Colorful SMD Easy installation, just plug & play. 1. Flash mode: Colorful dazzling changes ,2.Strobe mode: Colorful gradual changes, 3. Fade mode: Colorful with dazzling changes and fade in and out, 4. Smooth mode: Flashing between red and blue."
  },
  {
    "title": "Zaapy Back Cover for Vivo S1, Vivo Z1x  (Blue)",
    "price": 206,
    "currency": "INR",
    "original_price": 899,
    "discount": "77% off",
    "description": "premium quality polycarbonate material which is durable and light weight that ensures sleek and compact look for your Mobile phone . Every Printed Designer Pouch is printed with precision and designed in a way that it perfectly fits onto the back of the mobile phone."
  },
  {
    "title": "Nassion Back Cover for Infinix Smart 5A  (Multicolor, Grip Case, Silicon)",
    "price": 199,
    "currency": "INR",
    "original_price": 799,
    "discount": "75% off",
    "description": "Brand New Soft Designer Printed Case Express yourself by your phone and making it stand out. Many design and Prints in stock for your choice This Case keeps your PHONE safe and protected. Durable construction offers premium protection for side and back of your phone. Allows easy access to all buttons, controls and ports. Nassion is the manufacturer of the cover and print our own covers, And we Do not print the sides of the cover. So corners would always be transparent."
  },
  {
    "title": "Flipkart SmartBuy Back Cover for Honor Y5 2018  (White, Red)",
    "price": 219,
    "currency": "INR",
    "original_price": 399,
    "discount": "45% off",
    "description": "Flipkart Smartbuy back covers are the best attractive accessory to make your mobile unique from other models .The Premium case is made out of a light, durable plastic called Polycarbonate.It is strong enough to protect it from bumps, drops and scratches.Wide array of designs and models.A raised bezel protects your display when mobile is laid flat, and the volume and power buttons are explicitly carved, so all buttons and ports are easily accessible. This case is 100% compatible with your regular charger and headphones. Kindly Note: **There may be slight change in color of design printed on case as seen on website, as there can be different monitors/tablets/smart phones settings**."
  },
  {
    "title": "NOWADAYS Back Cover for Mi Redmi 7A  (Multicolor, Grip Case, Silicon)",
    "price": 217,
    "currency": "INR",
    "original_price": 499,
    "discount": "56% off",
    "description": "NOWADAYS gives you Redmi 7A Back Cover, the best Multicolor covers, This soft silicone Multicolor cover will protect and prevent your phone from scratches, damage and dust. The silicone cover is made from a lightweight tough strong high quality rubber/silicone material which will help you to keep your phone safe. It comes in smooth texture. This will not only look good on your phone but will protect it. This case will Style your mobile."
  },
  {
    "title": "Hello Case Back Cover for OnePlus 3,3T  (Multicolor, Hard Case)",
    "price": 233,
    "currency": "INR",
    "original_price": 899,
    "discount": "74% off",
    "description": "This premium back cover is an hello case qulity and highly durable in nature,power full protection all combined case"
  },
  {
    "title": "SMART BUYY Waterproof Two Wheeler Cover for Hero  (CBZ, Multicolor)",
    "price": 339,
    "currency": "INR",
    "original_price": 1899,
    "discount": "82% off",
    "description": "SmartBuyy Polyester water resistant body cover for bikes and scooties provides enhanced shielding to your vehicle against Moisture, Dirt, Dust, Weather Extremes, fading away from sunlight, Scratches. It is designed as per bike shape and comes with mirror pocket Protect. The material used to make this cover is Tafta Fabric( Parachute) which is known for its high performance and durability. Double line stitching by 5 threads and as well as overlock which ensures more strength and make it tear resistant. It guards the painted from UV rays and the internal engine parts from dust. Suitable for all weather conditions, easy to handle. The product can be used for both indoor and outdoor covering of two wheelers. Specifications:- They are mainly designed to provide all weather protection to two wheeler body parts from water, extremes weather condition. It is very light weighted cover which is easy to fold and carry."
  },
  {
    "title": "Alve Back Cover for Samsung Note 10 Plus (5G)  (Black)",
    "price": 299,
    "currency": "INR",
    "original_price": 850,
    "discount": "64% off"
  },
  {
    "title": "Phone Milaley.com Back Cover for Realme X (Jokar Batman film Poster, Heath ledger joker, CASES COVER, HARD CASE  (Multicolor, Waterproof)",
    "price": 199,
    "currency": "INR",
    "original_price": 999,
    "discount": "80% off",
    "description": "Realme X back cover by phone Milaley.com, Ultra Slim, Sleek and Light Weight Design Snap on Case Protect your phone from scratches and bumps,Image Full Wrap Finish (Side Edge & Corner) Tight and Firm fit for perfect grip and support. Specially Designed for Your Realme X"
  },
  {
    "title": "Mozo Back Cover for Samsung Galaxy Note 20 ultra  (Black, Flexible)",
    "price": 219,
    "currency": "INR",
    "original_price": 799,
    "discount": "72% off",
    "description": "We have designed it after understanding the needs of customer who wants to provide great protection to his phone and make their phone stand out in the crowd by enhancing its looks. It has high quality eco friendly materials, unique textures on back and perfectly fits to your Phone. Rugged Armor & Slim Case: Rugged Armor Series case provide 360 degree protection to your device while maintaining its slim profile. Its unique Air Cushion Technology and shock proof corners make your phone impact resistant from all sides on a drop. Raised Lips for Camera and Screen: Rugged Armor Case gives your phone an all round protection. Its intelligently designed upper lips extend over the sides of the phone to give an extra safety to your screen and camera on a fall and when kept down on a flat surface. Also, it takes care for smallest details of your phone such as sensors, protruding camera, speakers etc.. Specification: Maximum Gripability Cases & Covers Delivers Everyday Wear And Tear Protection Minimizes Sliding On Flat Surfaces And Extra Safety Against Smudges, Cracks And Dirt. It's The Perfect Case For Protecting Your Precious Mobile From All Shocks And Other Elements, While Keeping It As Good As New! Happy Shopping Friends!"
  },
  {
    "title": "UBL (Pack of 2) whisky Pack Of 2 Glass Set  (278 ml, Glass)",
    "price": 249,
    "currency": "INR",
    "original_price": 400,
    "discount": "37% off"
  },
  {
    "title": "RACHITS HANDICRAFTS Back Cover for Samsung Galaxy M40  (Multicolor)",
    "price": 179,
    "currency": "INR",
    "original_price": 888,
    "discount": "79% off",
    "description": "RACHITS HANDICRAFTS 3D Designer Case is made out of a light, durable plastic called Polycarbonate and This Case is very much safe for your Mobile. Easy to install and last for a long time and the pattern on the surface looks great. Hard Back Case provides protection by preventing your Mobile Phone from dust and unnecessary scratches. It is made to fit perfect and gives the Mobile its maximum protection. The Hard Case is reinforced from the Proper edges, sides and back to prolong the life of your Mobile Phone. Besides its protection, it also has openings precisely made for the side buttons, charger port / dock connector, headset jack and speaker which allow you full access to all the functions on your device. It is the perfect case for protecting your Phone from scratches, shock, and the elements."
  },
  {
    "title": "Yoprint Back Cover for vivo 1935/Y50 apna time aayega, best text back cover  (Multicolor, Shock Proof)",
    "price": 230,
    "currency": "INR",
    "original_price": 999,
    "discount": "76% off",
    "description": "Designed phone cover not only protects your precious handset but also increases the life span of your mobile. This particular handset back cover is very light in weight and can also be easily snapped on your handset. In todays world communication is very important and hence it is mandate to protect the ways we communicate. Mobile is one of the ways. So it is imperative to protect the same by taking few precautions. One of the main is to protect your handset back cover. The handset back cover of this model has a very unique and creative design printed on it to give it a more glamorous look. This peculiar design handset back cover is bound to grab the eye ball of people around you. It gives a very stylish and trendy look and is a perfect gift to present it to your loved ones. So, pep up your life and add color by purchasing"
  },
  {
    "title": "GNRCDIGITALMART Abstract Multicolor Wallpaper  (40 cm X 180 cm)",
    "price": 339,
    "currency": "INR",
    "original_price": 799,
    "discount": "57% off",
    "description": "This wallpaper decorates your home just in minutes. with this product you can brighten up your personal space in your home or office with new and decorative products. It is a great piece whether you wanted to have it one in your home or in office. It also makes great gifting options as well which is also Ideal for family lounge, bedroom,living room, office,cafe and restaurant."
  },
  {
    "title": "Trademark Art Canvas 15 inch x 30 inch Painting  (Without Frame)",
    "price": 7961,
    "currency": "INR",
    "original_price": 9105,
    "discount": "12% off"
  },
  {
    "title": "Bjain Robinia Pseudocacia 30 CH Dilution  (3 x 10 ml)",
    "price": 165,
    "currency": "INR"
  },
  {
    "title": "Instyle Back Cover for OnePlus 7  (Multicolor, Hard Case)",
    "price": 249,
    "currency": "INR",
    "original_price": 799,
    "discount": "68% off"
  },
  {
    "title": "SpeedRock Two Wheeler Cover for Bajaj  (CT 100, Silver)",
    "price": 331,
    "currency": "INR",
    "original_price": 657,
    "discount": "49% off",
    "description": "The SpeedRock two wheeler covers for motorcycles and scooters provide enhanced shielding to your vehicle against moisture, dirt, dust, extreme climatic conditions, color fading due to sunlight and body scratches. It protects the internal engine parts from dust and metal parts from catching rust. It guards the painted parts or leather upholstery from UV rays and is suitable for all climatic conditions, including rainy seasons. The cover is provided in a plastic bag for easy handling and store keeping. The product can be used for both indoor and outdoor applications. Bike body cover therefore allows for better protection of your two wheeler vehicle."
  },
  {
    "title": "Keviv Back Cover for Realme C2 2020  (Pink, 3D Case)",
    "price": 249,
    "currency": "INR",
    "original_price": 999,
    "discount": "75% off",
    "description": "Keviv® Print Design Hard Back Case will protect your Phone from Dust, Unnecessary Scratches and stains from your Mobile Phone. it is Made of high quality and highly durable in nature. It is made to perfect fit and gives the device its maximum protection. Keviv® Hard Case is made by PolyCarbonate material. It helps edges, sides and back to prolong the life of your Mobile Phone. Besides its protection, it also has openings precisely made for the side buttons, charger port / dock connector, headset jack and speaker which allow you full access to all the functions on your device. Easy to install and last for a long time and the pattern on the surface looks great. Keviv® cases are are made to bring fun back into designs. The cases are designed to be loud, unique and unconventional. They are an art form of self-expression for and ever evolving individual. Cases are designed in a way that it perfectly fits onto the back of the phone. It will give your phone an outstanding look. Designed Specially for your Phone, it fits perfectly, giving you access to all the features and functions of your phone with ease. The special material of this phone will give you a perfect look."
  },
  {
    "title": "Brothers Store Back Cover for Oppo A12  (Multicolor, Shock Proof)",
    "price": 229,
    "currency": "INR",
    "original_price": 1299,
    "discount": "82% off",
    "description": "Love your smartphones? Then why not it with the premium class of mobile covers! Brothers store suggestion, Then Complete Protection Impact-Resistant, Durable Polycarbonate Hard Case with an extremely slim profile, with raised front bezel for extra screen protection. High Quality Print Matte finish ultra HD print. Expect no peeling, chipping, or wearing off. Easy access to buttons Includes cut-outs for your regular charger and headphones. Precision molded with no seams or sharp edges. the premium class of mobile covers! Brothers store suggestion,"
  },
  {
    "title": "Plakasha creations Bracelet Chawal Roli Pack, Rakhi, Greeting Card, Mug  Set  (1 Rakhi 1 Mug 1 Roli Chawal 1 Greeting Card)",
    "price": 248,
    "currency": "INR",
    "original_price": 741,
    "discount": "66% off"
  },
  {
    "title": "SHRUHAD Printed Bandhani Silk Blend Saree  (Blue)",
    "price": 399,
    "currency": "INR",
    "original_price": 1499,
    "discount": "73% off"
  },
  {
    "title": "Yellow Alley Nature Trees Print Laptop Sticker |Laptop Sticker Printed on Vinyl|Laptop Sticker for All Models Upto 15.75|Laptop Skin Decal for IBM/Hp/Dell/Micromax/Lenovo/Acer|Laptop Skin Protector Eco-Vinyl Paper Laptop Decal 15.6",
    "price": 267,
    "currency": "INR",
    "original_price": 599,
    "discount": "55% off",
    "description": "Creative designs by Yellow Alley for your Laptops as well as Tabs! Do you want to stand\nout among all the other laptop users in your office, college or wherever you go? Now\nprotect your laptop and make it more fashionable at the same time through stylish laptop\nskins which can be wrapped around the laptop to provide security for the external\nsurface of the laptop. Our laptop skins are vinyl based with an adhesive layer on the\nunderside. The Laptop Stickers design are easy to apply or remove it as you please\nwithout thinking about any glue stains or residual marks on your laptop. A layer of\nlamination over high grade vinyl with most advanced printing technology helps us\nachieve very bright and realistic prints.\nApplying Instructions:\nTake the ruler and mark the side that requires trimming.\nCarefully cut-off the excess skin using scissors and when that is done, peel a part of one edge\nof the skin off the backing paper.\nProceed with folding the backing paper upwards and apply the skin to the edge of the laptop.\nTake the ruler and smooth the skin whilst simultaneously peeling the back paper off.\nRun the cloth on the surface to ensure that there are no bubbles. Enjoy the new look of your\nlaptop."
  },
  {
    "title": "Chaseit Flip Cover for Realme Narzo 20  (Blue, Shock Proof)",
    "price": 217,
    "currency": "INR",
    "original_price": 799,
    "discount": "72% off",
    "description": "Branded PU Leather Diary Wallet Style Flip Cover Case. This is the widest selling flip cover for this phone. It has soft TPU material inside for holding the phone. It protects the phone from bumps and scratches. Also it has card holder option inside for holding cash and card. This cover can also be used as a stand for placing the phone and watching videos. Overall this is the best case of its type. Functionality All the buttons and ports are easily accessible which makes the cover very convenient to use. The installation and removal of the cover is very easy. It is very light in weight hence does not make the phone bulky. It comes with card slots which makes the cover even more handy. Protection The cover gives the phone and its screen an all-round protection from all the external damages like dust, scratches, scrapes, dents etc and makes your phone look new and fresh all the time. It comes with shock protection which saves it from drops and bumps. Strength and Durability The cover is made of premium grade ma"
  },
  {
    "title": "PINKZAP Back Cover for Redmi 9 Power  (Multicolor, Grip Case, Silicon)",
    "price": 219,
    "currency": "INR",
    "original_price": 799,
    "discount": "72% off",
    "description": "Redmi 9 Power Back Cover, the best Multicolor covers, This soft silicone Multicolor cover will protect and prevent your phone from scratches, damage and dust. The silicone cover is made from a lightweight tough strong high quality rubber/silicone material which will help you to keep your phone safe. It comes in smooth texture. This will not only look good on your phone but will protect it. This case will Style your mobile."
  },
  {
    "title": "Emble Back Cover for Redmi 9  (Multicolor, Grip Case)",
    "price": 289,
    "currency": "INR",
    "original_price": 899,
    "discount": "67% off",
    "description": "Emble Designer cases will protect your Redmi 9 Phone from Dust, Scratches and stains. Material: 100% guarantee made from Plastic Material, It will give your phone an outstanding look. Designed specially for your Phone, it fits perfectly, giving you access to all the features and functions of your phone with ease. The special material of this phone will give you a perfect grip. If you're looking for something special and unique,Emble is the best solution"
  },
  {
    "title": "Coverit Two Wheeler Cover for Mahindra  (Blue)",
    "price": 279,
    "currency": "INR",
    "original_price": 699,
    "discount": "60% off",
    "description": "Bike Covers which is mainly used to protect your Bikes from weather extremes, fading away from sunlight, scratching etc. They are mainly designed to provide all weather protection to two wheeler body parts. It is designed as per bike shape."
  },
  {
    "title": "HRTTECH Back Cover for Vivo Y21 2021 , Vivo Y33s , Vivo Y21s , Vivo V2111 , Vivo V2109 , Vivo V2110  (Multicolor, Hard Case)",
    "price": 259,
    "currency": "INR",
    "original_price": 999,
    "discount": "74% off",
    "description": "HRT TECH Designer Printed Hard Back Case and Cover for Vivo Y21 2021 , Vivo Y33s , Vivo Y21s , Vivo V2111 , Vivo V2109 , Vivo V2110 B Loves S Name, Symbols, Letter, Alphabet, Design, Art. Hard printed back cover case for mobiles, they are stylish and funky. Our Print is high quality and Durable and the Case is designed to fit your Mobile Device perfectly. Trendy Stylish Back Cover for Girls, Women, Boy, Men, Girl, Woman, Boys, Man. Best Designs, Unique Gift For Every One. Wide range of designs to choose from too."
  },
  {
    "title": "Awsm Wallchiere Wall Lamp Without Bulb",
    "price": 699,
    "currency": "INR",
    "original_price": 1199,
    "discount": "41% off",
    "description": "Brighten up your room decor with this impeccable sconce wall lamp brought to you by \"awsm\". Crafted from the finest quality steel and glass,It is highly durable and light in weight. this wall lamp will remain the same for many years. It is designed to replace incandescent equivalents to save you energy and still achieve superior lighting. You can choose from a wide selection to light up your residential or commercial interior. Plus, this wall lamp will also keep your eyes safe. Graceful and grand, this light fixture is impressive. Additionally, this wall lamp comes with one cable connector and two screws."
  },
  {
    "title": "NK PAL STYLE Men Regular Fit Solid Casual Shirt",
    "price": 449,
    "currency": "INR",
    "original_price": 999,
    "discount": "55% off"
  },
  {
    "title": "BK Creations Back Cover for Vivo Y33s  (Multicolor, Dual Protection)",
    "price": 249,
    "currency": "INR",
    "original_price": 599,
    "discount": "58% off",
    "description": "BK Creations 3D Designer Hard Case Back Cover for Your Mobile Phone . this back cover provides protection by preventing your phone from dust and unnecessary Scratches. The print is fade proof and peel proof with lifetime warranty. Printed on the sides as well. Hard plastic printed case for mobile,3D imaging and printing technology in high resolution design and perfect finish, stylish with high durability.It is open from the top and bottom for easy snapping on and removal of the case and covers the left and right side of the case having openings precisely made for the side buttons, charger port / dock connector, headset jack and speaker which allow you full access to all the functions on your device. Premium quality cases cover to protect and make your Mobile look even more stylish."
  },
  {
    "title": "CustomEra Back Cover for Redmi Note 4 (Mom Dad Yellow Design)  (Multicolor, Hard Case)",
    "price": 249,
    "currency": "INR",
    "original_price": 549,
    "discount": "54% off",
    "description": "DN Enterprises presents 3D high quality polycarbonate back covers which provides which provides overall protection to all phone. This cover is specifically printed for you, therefore, please place the order once you are sure. Using Heat Transfer Technology and High Quality Permanent Ink, the colours are matched up to the maximum Print Ink Transfer rate of 90%. All designs come in HD and waterproof ink promising uncompromised quality. This back cover wraps around the back side of the mobile adding an extra layer of protection over your mobile phone. Our all covers comes with a 6 months printing warranty (Conditions apply)."
  },
  {
    "title": "Cambridge Connection Chemistry Class 7  (Paperback, Anand Kumar Mandhian)",
    "price": 230,
    "currency": "INR",
    "original_price": 250,
    "discount": "8% off",
    "description": "Anand Kumar Mandhian"
  },
  {
    "title": "APICAL LED Headlight for Mahindra Flyte",
    "price": 750,
    "currency": "INR",
    "original_price": 999,
    "discount": "24% off"
  },
  {
    "title": "Abuy Back Cover for Itel Vision 2s  (White, Black, Flexible, Silicon)",
    "price": 149,
    "currency": "INR",
    "original_price": 499,
    "discount": "70% off"
  },
  {
    "title": "varulax ROUNSY Triangle Stainless Steel Towel Ring (PACK OF 2)/ Towel Holder/ Napping Ring/ Unique Bath Towel Stand/ Towel Hanger Silver (STAINLESS STEEL) (PACK OF 2) SILVER Towel Holder  (Stainless Steel, Aluminium)",
    "price": 299,
    "currency": "INR",
    "original_price": 999,
    "discount": "70% off",
    "description": "Varulax Bathroom Towel Ring Has Prepared Simple And great/Unique Design for your Bathroom,kitchen And Home.which will enhance the decoration of your home after being installed in your kitchen,Bathroom And Home.It Has A Wall Mounted towel rings function as a hand towel holders and as a means to organise and Dry Bath Towels.Each kid can have their color towels as well as keep your kids Bathroom more organised.It has a modern style, making it perfect if you're looking to freshen up your bathroom design with a contemporary touch.It is equipped with fitting tools, ensuring that setup time is effortless.Flexible & High in Strength. Easy clean by wet cloth.Chrome Finish with Stainless Steel Material for long last Shine and Strength.Rust and Corrosion Proof."
  },
  {
    "title": "BK Creations Back Cover for Realme C12  (Multicolor, Dual Protection)",
    "price": 249,
    "currency": "INR",
    "original_price": 599,
    "discount": "58% off",
    "description": "BK Creations 3D Designer Hard Case Back Cover for Your Mobile Phone . this back cover provides protection by preventing your phone from dust and unnecessary Scratches. The print is fade proof and peel proof with lifetime warranty. Printed on the sides as well. Hard plastic printed case for mobile,3D imaging and printing technology in high resolution design and perfect finish, stylish with high durability.It is open from the top and bottom for easy snapping on and removal of the case and covers the left and right side of the case having openings precisely made for the side buttons, charger port / dock connector, headset jack and speaker which allow you full access to all the functions on your device. Premium quality cases cover to protect and make your Mobile look even more stylish."
  },
  {
    "title": "stroxy Back Cover for Micromax IN Note 1  (Multicolor, Silicon)",
    "price": 208,
    "currency": "INR",
    "original_price": 799,
    "discount": "73% off",
    "description": "Mobile Back Covers Are The Best Attractive Accessory To Make Your Mobile Phone Unique From Other Models And Keep Protected From Scratches And Dust. It Is The Newest Trend In The Mobile Phone Accessories For The Dual Purpose Of Personalization And Protection As Well."
  },
  {
    "title": "ACTOVISH Handle Light Bar/ Bike Motorcycle Modify LED Light_32 Fog Lamp, Indicator Light, Side Marker, Mirror Light, Headlight, Dash Light, Back Up Lamp Motorbike, Car, Truck LED for Royal Enfield (12 V, 15 W)  (Thunderbird 500, Pack of 2)",
    "price": 411,
    "currency": "INR",
    "original_price": 799,
    "discount": "48% off",
    "description": "ACTOVISH presents you white blue handle Led Light These LED indicators for motorcycle handles are easy to attract attention while being pleasing to the eye. It helps your fellow motorists to know which direction you are going easily. These bar end indicators can be installed by any professional on the extreme ends of the handlebars. Their powerful lighting ensures that they are bright enough to offer safety on the road, even at night. The front tapered design and metal build further enhance the style quotient of the bike."
  },
  {
    "title": "Indianara Set of 3 Flowers in Pots Framed Art Painting (4086WNT) without glass Digital Reprint 13 inch x 10.2 inch Painting  (With Frame, Pack of 3)",
    "price": 269,
    "currency": "INR",
    "original_price": 1200,
    "discount": "77% off",
    "description": "Decorate the walls of your living room, hall, bedroom, shop, office or hotel with wall paintings. this product comes with high quality frames with UV coated posters. It has hanging hooks on back side of MDF and since it is light in weight you can use double side tape as well for easy mounting. Decorate the walls of your living room, hall, bedroom, shop, office or hotel with wall paintings. this product comes with high quality frames with UV coated posters. It has hanging hooks on back side of MDF and since it is light in weight you can use double side tape as well for easy mounting. The composite size of these Framed wall paintings. Painting will be packed in 5 ply corrugated box to avoid damage. Made of durable and non-toxic material it will be an appropriate gift for special occasions such as birthday, festival, marriage, anniversary and home opening/ house warming ceremony."
  },
  {
    "title": "DBR SAFE Back Cover for Realme 5  (Black, Hard Case)",
    "price": 229,
    "currency": "INR",
    "original_price": 999,
    "discount": "77% off",
    "description": "Designer Printed Hard Back Case and Cover for Realme 5, RMX1911,Dad,Love,love, ,love,Mom,&,Dad,,Love,Mom,&,Dad,couple,Love,couple.Our Print is high quality and Durable and the Case is designed to fit your Mobile Device perfectly. Trendy Stylish Back Cover for Girls, Women, Boy, Men, Girl, Woman, Boys, Man. Best Designs, Unique Gift For Every One"
  },
  {
    "title": "Metodo Per l'Accompagnamento del Canto Gregoriano E Per La Composizione Negli Otto Modi Con Un'appendice Sulla Risposta Nella Fuga (Classic Reprint)  (Italian, Hardcover, Bas Giulio)",
    "price": 1486,
    "currency": "INR",
    "original_price": 1651,
    "discount": "9% off",
    "description": "Bas Giulio"
  },
  {
    "title": "Shubham designer gallery Baby Boys & Baby Girls Cartoon / Superhero Poly Silk T Shirt  (White, Pack of 1)",
    "price": 189,
    "currency": "INR",
    "original_price": 599,
    "discount": "68% off"
  },
  {
    "title": "IndiWeaves Boys & Girls Casual Sweatshirt Track Pants  (Multicolor)",
    "price": 1599,
    "currency": "INR",
    "original_price": 3199,
    "discount": "50% off"
  },
  {
    "title": "Sankee Back Cover for Sony Xperia XA1 Plus  (Multicolor, Hard Case)",
    "price": 399,
    "currency": "INR",
    "original_price": 600,
    "discount": "33% off",
    "description": "Specially Designed for Sony Xperia XA1 Plus.\r\nSankee Back Cover for Sony Xperia XA1 Plus is made out of a light, durable plastic called Polycarbonate with matte finish. It is flexible enough to snap on to your Sony Xperia XA1 Plus with ease and strong enough to protect it from bumps drops and scratches. The raised lip on the sides of the case also protects your phone's screen. The design on this perfectly finished Sankee Sony Xperia XA1 Plus case covers 100% of the outer surface of the case. The case is precision molded with no seams or sharp edges. Precision cutouts on this case leave all buttons, ports, speakers and microphones completely open. Sankee Sony Xperia XA1 Plus case is 100% compatible with your regular charger and headphones.SaleDart designs are a bunch of designs selected to suit the style of people with any taste. #iamsankee #sankeecover"
  },
  {
    "title": "Solid Men Black, Red T-Shirt  (Pack of 2)",
    "price": 449,
    "currency": "INR"
  },
  {
    "title": "Boodbuck Printed, Graphic Print Men Round Neck Yellow T-Shirt",
    "price": 379,
    "currency": "INR",
    "original_price": 2499,
    "discount": "84% off"
  },
  {
    "title": "Flipkart SmartBuy Back Cover for Mi 10T Pro  (Multicolor, Hard Case)",
    "price": 249,
    "currency": "INR",
    "original_price": 1199,
    "discount": "79% off",
    "description": "Flipkart SmartBuy Phone covers is an adorable amazing phone covers that completely enhances the looks of your phone. The main advantage is that it minimizes the scratches that can be caused to the back covers of the phone. It perfectly sticks to the back of your phone and make it look absolutely gorgeous. Further it is made of high quality and is highly durable in nature. The color of the back covers is also very latest and stylish. It can also be used as a gift to be showcased it to the loved ones."
  },
  {
    "title": "RACHITS HANDICRAFTS Back Cover for Mi Redmi 8A Dual  (Multicolor)",
    "price": 188,
    "currency": "INR",
    "original_price": 999,
    "discount": "81% off",
    "description": "RACHITS HANDICRAFTS 3D Designer Case is made out of a light, durable plastic called Polycarbonate and This Case is very much safe for your Mobile. Easy to install and last for a long time and the pattern on the surface looks great. Hard Back Case provides protection by preventing your Mobile Phone from dust and unnecessary scratches. It is made to fit perfect and gives the Mobile its maximum protection. The Hard Case is reinforced from the Proper edges, sides and back to prolong the life of your Mobile Phone. Besides its protection, it also has openings precisely made for the side buttons, charger port / dock connector, headset jack and speaker which allow you full access to all the functions on your device. It is the perfect case for protecting your Phone from scratches, shock, and the elements."
  },
  {
    "title": "CE LIGHTS CE 7W WHITE DLR Recessed Ceiling Lamp",
    "price": 897,
    "currency": "INR",
    "original_price": 1920,
    "discount": "53% off",
    "description": "EXCELLENT LIGHTING & SUPER BRIGHT: Up To 80 High CRI, Which Produce a More Accurate Color Rendering of the Objects around It, Make Your Surroundings Clear, Bright And As Close To How They Would Appear In An Outdoor, Natural Setting. Adopt 2835 SMD High Quality LED Chips,, High Luminous Efficiency Bring Your Application The Best Lighting Available. ENERGY SAVING & LONG LIFESPAN: Concealed Light Ceiling Light With Upgraded 2835 LED Chips Save Energy Up To 80% Than The Traditional Ceiling Fixtures. No Need Of Extra Bulbs. With Integrated LED Lights, This Led Ceiling Light Is Qualified To Last More Than 50,000 Hours And Won't Degrade Over Time. Save Your Effort To Replace Bulbs In High Ceiling. SAFE AND ENVIRONMENTALLY FRIENDLY: The Outer Casing Is Made Of PP & Aluminum Material. The Ceiling Lamp Contains No Mercury and Harmful Substances, No Infrared Or Ultraviolet Radiation, And Used Safely. ECO-FRIENDLY & EYE-PROTECTION: Material Used Aluminum & PS Acrylic Diffuser Which Is Very Safe And Durable. Aluminum Is Fast In Rejection Of Heat, It Can Extend The LED's Using Life. No IR And UV Radiation, No Mercury And Hazardous Substance Contained In The Ceiling Light Fixtures, Making Them Perfectly Ecological. Giving Off Uniform and Bright Light Without Flickering, Keeping Your Eyes Free From Harsh and Glare Lights. EASY TO INSTALL: Our Concealed Ceiling Light Fixture Can Be Mounted On The Ceiling Directly, No Need Drilling A Big Hole For Installation Easy To Install This Ceiling Panel Light For Hotel, Laundry Room, Stairs, Attic, Patio, Porch, Kitchen Sink, Washroom, Bathroom, Conference, Meeting Room, Show Room, Showcase, School, University, Hospital, Supermarket, Department Store As You Like."
  },
  {
    "title": "Jewels Capital Alloy Gold-plated Jewel Set  (Blue, Gold)",
    "price": 475,
    "currency": "INR",
    "original_price": 1730,
    "discount": "72% off"
  },
  {
    "title": "Shoefly Lace Running Shoes For Boys & Girls  (Black)",
    "price": 715,
    "currency": "INR",
    "original_price": 998,
    "discount": "28% off"
  },
  {
    "title": "United Colors of Benetton Solid Men Polo Neck Green T-Shirt",
    "price": 1999,
    "currency": "INR"
  },
  {
    "title": "RACHITS HANDICRAFTS Back Cover for Vivo Y20, Vivo Y20i, Vivo Y20G, Vivo Y20A, Vivo Y12s  (Multicolor)",
    "price": 189,
    "currency": "INR",
    "original_price": 999,
    "discount": "81% off",
    "description": "RACHITS HANDICRAFTS 3D Designer Case is made out of a light, durable plastic called Polycarbonate and This Case is very much safe for your Mobile. Easy to install and last for a long time and the pattern on the surface looks great. Hard Back Case provides protection by preventing your Mobile Phone from dust and unnecessary scratches. It is made to fit perfect and gives the Mobile its maximum protection. The Hard Case is reinforced from the Proper edges, sides and back to prolong the life of your Mobile Phone. Besides its protection, it also has openings precisely made for the side buttons, charger port / dock connector, headset jack and speaker which allow you full access to all the functions on your device. It is the perfect case for protecting your Phone from scratches, shock, and the elements."
  },
  {
    "title": "PEPART Back Cover for OPPO A7  (Multicolor)",
    "price": 210,
    "currency": "INR",
    "original_price": 599,
    "discount": "64% off",
    "description": "Hard plastic printed case for mobiles, stylish with high durability. It adds style and perfectly fits on your phone. Wide range of designs to choose from."
  },
  {
    "title": "Super Compatible USB Fast Charging Cable 480Mbps Data transfer 1 m Micro USB Cable  (Compatible with All Micro USB Supported Devices, Red, Multicolor)",
    "price": 179,
    "currency": "INR",
    "original_price": 500,
    "discount": "64% off",
    "description": "Micro Data Cable charging and quick sync with the essential cord is designed for use with USB Cable Compatible with all Android and Other Micro USB Supported Devices. Power up your devices and transfer music, movies and other media with ease the speed of 480 mbps and it also provides high speed data transmission along with fast charging and data syncing. It has high quality anti-rust charging pin that ensures the safety of the charging port Keep the cable on-hand in a desk drawer or travel carry-on for convenience and lightweight charging cable also allows your phones to transfer the data high performance you can trust. Universally Convenience Ideal for home, workplace, car, or nightstand, the charging-and-syncing cable provides everyday convenience and versatility. Compatibility With all Android Device. (Random Color)"
  },
  {
    "title": "Hansviprint Back Cover for Tecno Camon iSky3  (Multicolor, Grip Case, Silicon)",
    "price": 239,
    "currency": "INR",
    "original_price": 799,
    "discount": "70% off",
    "description": "These designs on the cases are designed by \"Hansviprint\" .This designer case allows easy access to all buttons controls. This designer Case Cover is Attractive, Comfortable, Light Weight and has unique design it perfectly fit and protects your smartphones. Easy to install & easy Remove. High quality printed case cover with perfect design."
  },
  {
    "title": "Akeeta Men Solid Mid-Calf/Crew  (Pack of 6)",
    "price": 449,
    "currency": "INR",
    "original_price": 1299,
    "discount": "65% off"
  },
  {
    "title": "Ein geniales Fruchtchen  (German, Paperback, unknown)",
    "price": 1102,
    "currency": "INR",
    "description": "unknown"
  },
  {
    "title": "VAN HEUSEN Men Slim Fit Geometric Print Casual Shirt",
    "price": 1323,
    "currency": "INR",
    "original_price": 2699,
    "discount": "50% off"
  },
  {
    "title": "NEUTRON New Collegian Sports And Apna Time Aayega Slim Watch 2 Watch Combo For Boys And Men - BRA16-B407 combo watch Analog Watch  - For Boys",
    "price": 388,
    "currency": "INR",
    "original_price": 471,
    "discount": "17% off"
  },
  {
    "title": "Instyle Back Cover for OPPO Realme 1  (Multicolor, Hard Case)",
    "price": 249,
    "currency": "INR",
    "original_price": 799,
    "discount": "68% off",
    "description": "Hard Cases are are made to Bring Fun back into designs.The CASES are DESIGNED TO BE LOUD , UNIQUE AND UNCONVENTIONAL. They are an art form of Self-Expression for and ever evolving Individual. Cases are designed in a way that it perfectly fits onto the back of the phone. Made of high quality and highly durable in nature."
  },
  {
    "title": "MOZZY Back Cover for Gionee M7 Power Back Cover  (Multicolor, Grip Case, Silicon)",
    "price": 229,
    "currency": "INR",
    "original_price": 499,
    "discount": "54% off",
    "description": "MOZZY gives you Gionee M7 Power Back Cover, the best Multicolor covers, This soft silicone Multicolor cover will protect and prevent your phone from scratches, damage and dust. The silicone cover is made from a lightweight tough strong high quality rubber/silicone material which will help you to keep your phone safe. It comes in smooth texture. This will not only look good on your phone but will protect it. This case will Style your mobile."
  },
  {
    "title": "omnmo Back Cover for Redmi Note 11 Pro 5G  (Multicolor, Dual Protection, Silicon)",
    "price": 229,
    "currency": "INR",
    "original_price": 649,
    "discount": "64% off",
    "description": "omnmo Designer cases will makes your cellphone smarty and protect your Phone from Dust, Scratches and stains. It will give your phone an outstanding look. Designed Specially for your Phone, it fits perfectly, giving you access to all the features and functions of your phone with ease. The special material of this phone will give you a perfect grip"
  }
]